evaluation_tests/test2_webserver/tc2_js_curve_c16/step05_rps16__assets_index_u5eV4oN_js.txt
Running 30s test @ http://54.235.233.71/assets/index-u5eV4oN_.js
  4 threads and 16 connections
  Thread calibration: mean lat.: 787.318ms, rate sampling interval: 2615ms
  Thread calibration: mean lat.: 1176.665ms, rate sampling interval: 3727ms
  Thread calibration: mean lat.: 835.137ms, rate sampling interval: 2408ms
  Thread calibration: mean lat.: 709.824ms, rate sampling interval: 1978ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   754.04ms  339.53ms   2.36s    75.23%
    Req/Sec     3.57      0.56     4.00     96.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  681.98ms
 75.000%  845.31ms
 90.000%    1.22s 
 99.000%    1.86s 
 99.900%    2.36s 
 99.990%    2.36s 
 99.999%    2.36s 
100.000%    2.36s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     339.455     0.000000            1         1.00
     406.783     0.100000           33         1.11
     491.775     0.200000           65         1.25
     550.399     0.300000           97         1.43
     622.079     0.400000          130         1.67
     681.983     0.500000          163         2.00
     710.143     0.550000          178         2.22
     733.183     0.600000          194         2.50
     757.247     0.650000          210         2.86
     812.031     0.700000          227         3.33
     846.847     0.750000          243         4.00
     882.175     0.775000          251         4.44
     935.935     0.800000          259         5.00
     997.887     0.825000          267         5.71
    1057.791     0.850000          275         6.67
    1164.287     0.875000          283         8.00
    1183.743     0.887500          287         8.89
    1220.607     0.900000          291        10.00
    1304.575     0.912500          295        11.43
    1340.415     0.925000          299        13.33
    1370.111     0.937500          303        16.00
    1472.511     0.943750          305        17.78
    1513.471     0.950000          307        20.00
    1583.103     0.956250          309        22.86
    1602.559     0.962500          311        26.67
    1605.631     0.968750          313        32.00
    1616.895     0.971875          314        35.56
    1655.807     0.975000          315        40.00
    1681.407     0.978125          316        45.71
    1689.599     0.981250          317        53.33
    1726.463     0.984375          318        64.00
    1739.775     0.985938          319        71.11
    1739.775     0.987500          319        80.00
    1856.511     0.989062          320        91.43
    1856.511     0.990625          320       106.67
    1948.671     0.992188          321       128.00
    1948.671     0.992969          321       142.22
    1948.671     0.993750          321       160.00
    2187.263     0.994531          322       182.86
    2187.263     0.995313          322       213.33
    2187.263     0.996094          322       256.00
    2187.263     0.996484          322       284.44
    2187.263     0.996875          322       320.00
    2357.247     0.997266          323       365.71
    2357.247     1.000000          323          inf
#[Mean    =      754.037, StdDeviation   =      339.528]
#[Max     =     2355.200, Total count    =          323]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  480 requests in 30.02s, 97.64MB read
Requests/sec:     15.99
Transfer/sec:      3.25MB