evaluation_tests/test2_webserver/tc2_js_curve_c16/step06_rps18__assets_index_u5eV4oN_js.txt
Running 30s test @ http://54.235.233.71/assets/index-u5eV4oN_.js
  4 threads and 16 connections
  Thread calibration: mean lat.: 2367.442ms, rate sampling interval: 7634ms
  Thread calibration: mean lat.: 2670.152ms, rate sampling interval: 9904ms
  Thread calibration: mean lat.: 1135.331ms, rate sampling interval: 4579ms
  Thread calibration: mean lat.: 1980.336ms, rate sampling interval: 10534ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.85s     4.76s   19.87s    72.52%
    Req/Sec     2.56      1.07     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.26s 
 75.000%    9.78s 
 90.000%   13.05s 
 99.000%   18.14s 
 99.900%   19.89s 
 99.990%   19.89s 
 99.999%   19.89s 
100.000%   19.89s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     484.351     0.000000            1         1.00
    1108.991     0.100000           23         1.11
    1600.511     0.200000           45         1.25
    2127.871     0.300000           67         1.43
    2990.079     0.400000           89         1.67
    4255.743     0.500000          111         2.00
    4767.743     0.550000          123         2.22
    5423.103     0.600000          134         2.50
    7041.023     0.650000          145         2.86
    8470.527     0.700000          156         3.33
    9781.247     0.750000          167         4.00
    9945.087     0.775000          173         4.44
   10190.847     0.800000          178         5.00
   10780.671     0.825000          184         5.71
   11747.327     0.850000          189         6.67
   12287.999     0.875000          195         8.00
   12894.207     0.887500          198         8.89
   13049.855     0.900000          200        10.00
   13508.607     0.912500          203        11.43
   14213.119     0.925000          206        13.33
   14696.447     0.937500          209        16.00
   14811.135     0.943750          210        17.78
   14819.327     0.950000          211        20.00
   15155.199     0.956250          213        22.86
   15384.575     0.962500          214        26.67
   16875.519     0.968750          216        32.00
   16875.519     0.971875          216        35.56
   16957.439     0.975000          217        40.00
   17203.199     0.978125          218        45.71
   17203.199     0.981250          218        53.33
   17612.799     0.984375          219        64.00
   17612.799     0.985938          219        71.11
   18137.087     0.987500          220        80.00
   18137.087     0.989062          220        91.43
   18137.087     0.990625          220       106.67
   18972.671     0.992188          221       128.00
   18972.671     0.992969          221       142.22
   18972.671     0.993750          221       160.00
   18972.671     0.994531          221       182.86
   18972.671     0.995313          221       213.33
   19890.175     0.996094          222       256.00
   19890.175     1.000000          222          inf
#[Mean    =     5852.284, StdDeviation   =     4758.240]
#[Max     =    19873.792, Total count    =          222]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  346 requests in 30.02s, 72.18MB read
  Socket errors: connect 0, read 0, write 0, timeout 28
Requests/sec:     11.52
Transfer/sec:      2.40MB