evaluation_tests/test2_webserver/tc2_js_curve_c16/step07_rps20__assets_index_u5eV4oN_js.txt
Running 30s test @ http://54.235.233.71/assets/index-u5eV4oN_.js
  4 threads and 16 connections
  Thread calibration: mean lat.: 1103.152ms, rate sampling interval: 6066ms
  Thread calibration: mean lat.: 1113.817ms, rate sampling interval: 2914ms
  Thread calibration: mean lat.: 1215.183ms, rate sampling interval: 5525ms
  Thread calibration: mean lat.: 973.777ms, rate sampling interval: 3459ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.85s     1.98s   10.84s    87.47%
    Req/Sec     4.24      0.55     5.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  907.26ms
 75.000%    2.07s 
 90.000%    4.79s 
 99.000%    9.98s 
 99.900%   10.85s 
 99.990%   10.85s 
 99.999%   10.85s 
100.000%   10.85s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     320.511     0.000000            1         1.00
     553.471     0.100000           38         1.11
     630.783     0.200000           75         1.25
     713.215     0.300000          113         1.43
     816.127     0.400000          150         1.67
     907.263     0.500000          188         2.00
     995.327     0.550000          208         2.22
    1148.927     0.600000          225         2.50
    1476.607     0.650000          244         2.86
    1700.863     0.700000          263         3.33
    2121.727     0.750000          282         4.00
    2623.487     0.775000          291         4.44
    3088.383     0.800000          300         5.00
    3209.215     0.825000          310         5.71
    3567.615     0.850000          319         6.67
    3880.959     0.875000          329         8.00
    4182.015     0.887500          333         8.89
    4788.223     0.900000          338        10.00
    5173.247     0.912500          343        11.43
    5464.063     0.925000          347        13.33
    5873.663     0.937500          352        16.00
    6131.711     0.943750          354        17.78
    6356.991     0.950000          357        20.00
    6447.103     0.956250          359        22.86
    6627.327     0.962500          361        26.67
    7045.119     0.968750          364        32.00
    7094.271     0.971875          365        35.56
    7237.631     0.975000          366        40.00
    7389.183     0.978125          367        45.71
    8413.183     0.981250          368        53.33
    9691.135     0.984375          370        64.00
    9691.135     0.985938          370        71.11
    9977.855     0.987500          371        80.00
    9977.855     0.989062          371        91.43
   10174.463     0.990625          372       106.67
   10403.839     0.992188          373       128.00
   10403.839     0.992969          373       142.22
   10403.839     0.993750          373       160.00
   10403.839     0.994531          373       182.86
   10682.367     0.995313          374       213.33
   10682.367     0.996094          374       256.00
   10682.367     0.996484          374       284.44
   10682.367     0.996875          374       320.00
   10682.367     0.997266          374       365.71
   10846.207     0.997656          375       426.67
   10846.207     1.000000          375          inf
#[Mean    =     1851.875, StdDeviation   =     1983.428]
#[Max     =    10838.016, Total count    =          375]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  556 requests in 30.02s, 114.76MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:     18.52
Transfer/sec:      3.82MB