evaluation_tests/test2_webserver/tc2_js_curve_c16/step08_rps22__assets_index_u5eV4oN_js.txt
Running 30s test @ http://54.235.233.71/assets/index-u5eV4oN_.js
  4 threads and 16 connections
  Thread calibration: mean lat.: 1209.026ms, rate sampling interval: 4456ms
  Thread calibration: mean lat.: 1325.455ms, rate sampling interval: 4173ms
  Thread calibration: mean lat.: 870.697ms, rate sampling interval: 3092ms
  Thread calibration: mean lat.: 997.499ms, rate sampling interval: 4155ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.59s     1.48s    8.54s    89.03%
    Req/Sec     4.28      0.87     6.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.02s 
 75.000%    2.11s 
 90.000%    3.48s 
 99.000%    7.19s 
 99.900%    8.55s 
 99.990%    8.55s 
 99.999%    8.55s 
100.000%    8.55s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     237.695     0.000000            1         1.00
     431.615     0.100000           40         1.11
     555.007     0.200000           80         1.25
     641.535     0.300000          118         1.43
     769.535     0.400000          157         1.67
    1015.807     0.500000          196         2.00
    1207.295     0.550000          216         2.22
    1480.703     0.600000          236         2.50
    1689.599     0.650000          255         2.86
    1931.263     0.700000          275         3.33
    2111.487     0.750000          294         4.00
    2187.263     0.775000          304         4.44
    2273.279     0.800000          314         5.00
    2402.303     0.825000          324         5.71
    2506.751     0.850000          334         6.67
    2723.839     0.875000          343         8.00
    2920.447     0.887500          348         8.89
    3483.647     0.900000          353        10.00
    3839.999     0.912500          358        11.43
    4243.455     0.925000          363        13.33
    4841.471     0.937500          368        16.00
    4907.007     0.943750          370        17.78
    4976.639     0.950000          373        20.00
    5033.983     0.956250          375        22.86
    5357.567     0.962500          378        26.67
    5734.399     0.968750          380        32.00
    5926.911     0.971875          381        35.56
    5992.447     0.975000          383        40.00
    6049.791     0.978125          384        45.71
    6381.567     0.981250          385        53.33
    6422.527     0.984375          386        64.00
    6721.535     0.985938          387        71.11
    7188.479     0.987500          388        80.00
    7188.479     0.989062          388        91.43
    7221.247     0.990625          389       106.67
    7221.247     0.992188          389       128.00
    7876.607     0.992969          390       142.22
    7876.607     0.993750          390       160.00
    7876.607     0.994531          390       182.86
    8032.255     0.995313          391       213.33
    8032.255     0.996094          391       256.00
    8032.255     0.996484          391       284.44
    8032.255     0.996875          391       320.00
    8032.255     0.997266          391       365.71
    8552.447     0.997656          392       426.67
    8552.447     1.000000          392          inf
#[Mean    =     1593.950, StdDeviation   =     1476.323]
#[Max     =     8544.256, Total count    =          392]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  597 requests in 30.02s, 122.77MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:     19.88
Transfer/sec:      4.09MB